Revit 2027 API
BuiltInFailures.StructuralAssetFailures.StructuralMaterialAssetInvalid Property
 Material assigned to the Analytical Element does not contain Structure parameters - verify material content.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralMaterialAssetInvalid { get; }
Public Shared ReadOnly Property StructuralMaterialAssetInvalid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralMaterialAssetInvalid {
	FailureDefinitionId^ get ();
}
static member StructuralMaterialAssetInvalid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralAssetFailures Class
Autodesk.Revit.DB Namespace